/******************************************************************************/
/* A test                                                                     */
/******************************************************************************/
Say "hi" -- A line comment
a~"method"
